Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMR21_DFP/2.0.42/atdf/ATSAMR21G17A.atdf
      <value-group name="SERCOM_SPIM_CTRLA__CPOL">
        <value name="IDLE_LOW" caption="SCK is low when idle" value="0x0"/>
        <value name="IDLE_HIGH" caption="SCK is high when idle" value="0x1"/>
      </value-group>
      <value-group name="SERCOM_SPIM_CTRLA__DORD">
        <value name="MSB" caption="MSB is transferred first" value="0x0"/>
        <value name="LSB" caption="LSB is transferred first" value="0x1"/>
      </value-group>
      <value-group name="SERCOM_SPIM_CTRLA__DOPO">
        <value name="PAD0" caption="DO on PAD[0], SCK on PAD[1] and SS on PAD[2]" value="0x0"/>
        <value name="PAD1" caption="DO on PAD[2], SCK on PAD[3] and SS on PAD[1]" value="0x1"/>
        <value name="PAD2" caption="DO on PAD[3], SCK on PAD[1] and SS on PAD[2]" value="0x2"/>
        <value name="PAD3" caption="DO on PAD[0], SCK on PAD[3] and SS on PAD[1]" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_SPIM_CTRLA__DIPO">
        <value name="PAD0" caption="SERCOM PAD[0]" value="0x0"/>
        <value name="PAD1" caption="SERCOM PAD[1]" value="0x1"/>
        <value name="PAD2" caption="SERCOM PAD[2]" value="0x2"/>
        <value name="PAD3" caption="SERCOM PAD[3]" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_SPIM_CTRLA__FORM">
        <value name="SPI_FRAME" caption="SPI Frame" value="0x0"/>
        <value name="SPI_FRAME_WITH_ADDR" caption="SPI Frame with Addr" value="0x2"/>
      </value-group>
      <value-group name="SERCOM_SPIM_CTRLB__CHSIZE">
        <value name="8_BIT" caption="8 bits" value="0x0"/>
        <value name="9_BIT" caption="9 bits" value="0x1"/>
      </value-group>
      <value-group name="SERCOM_SPIM_CTRLB__AMODE">
        <value name="MASK" caption="SPI Address mask " value="0x0"/>
        <value name="2_ADDRESSES" caption="Two unique Addressess" value="0x1"/>
        <value name="RANGE" caption="Address Range" value="0x2"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLA__MODE">
        <value name="USART_EXT_CLK" caption="USART with external clock" value="0x0"/>
        <value name="USART_INT_CLK" caption="USART with internal clock" value="0x1"/>
        <value name="SPI_SLAVE" caption="SPI in slave operation" value="0x2"/>
        <value name="SPI_MASTER" caption="SPI in master operation" value="0x3"/>
        <value name="I2C_SLAVE" caption="I2C slave operation" value="0x4"/>
        <value name="I2C_MASTER" caption="I2C master operation" value="0x5"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLA__CMODE">
        <value name="ASYNC" caption="Asynchronous Communication" value="0x0"/>
        <value name="SYNC" caption="Synchronous Communication" value="0x1"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLA__CPOL">
        <value name="IDLE_LOW" caption="TxD Change:- Rising XCK edge, RxD Sample:- Falling XCK edge" value="0x0"/>
        <value name="IDLE_HIGH" caption="TxD Change:- Falling XCK edge, RxD Sample:- Rising XCK edge" value="0x1"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLA__DORD">
        <value name="MSB" caption="MSB is transmitted first" value="0x0"/>
        <value name="LSB" caption="LSB is transmitted first" value="0x1"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLA__FORM">
        <value name="USART_FRAME_NO_PARITY" caption="USART frame" value="0x0"/>
        <value name="USART_FRAME_WITH_PARITY" caption="USART frame with parity" value="0x1"/>
        <value name="USART_FRAME_AUTO_BAUD_NO_PARITY" caption="Auto-baud - break detection and auto-baud" value="0x4"/>
        <value name="USART_FRAME_AUTO_BAUD_WITH_PARITY" caption="Auto-baud - break detection and auto-baud with parity" value="0x5"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLA__RXPO">
        <value name="PAD0" caption="SERCOM PAD[0] is used for data reception" value="0x0"/>
        <value name="PAD1" caption="SERCOM PAD[1] is used for data reception" value="0x1"/>
        <value name="PAD2" caption="SERCOM PAD[2] is used for data reception" value="0x2"/>
        <value name="PAD3" caption="SERCOM PAD[3] is used for data reception" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLA__TXPO">
        <value name="PAD0" caption="PAD[0] = TxD; PAD[1] = XCK" value="0x0"/>
        <value name="PAD1" caption="PAD[2] = TxD; PAD[3] = XCK" value="0x1"/>
        <value name="PAD2" caption="PAD[0] = TxD; PAD[2] = RTS; PAD[3] = CTS" value="0x2"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLA__SAMPR">
        <value name="16X_ARITHMETIC" caption="16x over-sampling using arithmetic baudrate generation" value="0x0"/>
        <value name="16X_FRACTIONAL" caption="16x over-sampling using fractional baudrate generation" value="0x1"/>
        <value name="8X_ARITHMETIC" caption="8x over-sampling using arithmetic baudrate generation" value="0x2"/>
        <value name="8X_FRACTIONAL" caption="8x over-sampling using fractional baudrate generation" value="0x3"/>
        <value name="3X_ARITHMETIC" caption="3x over-sampling using arithmetic baudrate generation" value="0x4"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLA__SAMPA">
        <value name="ADJ0" caption="16x Over-sampling = 7-8-9; 8x Over-sampling = 3-4-5" value="0x0"/>
        <value name="ADJ1" caption="16x Over-sampling = 9-10-11; 8x Over-sampling = 4-5-6" value="0x1"/>
        <value name="ADJ2" caption="16x Over-sampling = 11-12-13; 8x Over-sampling = 5-6-7" value="0x2"/>
        <value name="ADJ3" caption="16x Over-sampling = 13-14-15; 8x Over-sampling = 6-7-8" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLB__CHSIZE">
        <value name="8_BIT" caption="8 Bits" value="0x0"/>
        <value name="9_BIT" caption="9 Bits" value="0x1"/>
        <value name="5_BIT" caption="5 Bits" value="0x5"/>
        <value name="6_BIT" caption="6 Bits" value="0x6"/>
        <value name="7_BIT" caption="7 Bits" value="0x7"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLB__PMODE">
        <value name="EVEN" caption="Even Parity" value="0x0"/>
        <value name="ODD" caption="Odd Parity" value="0x1"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLB__SBMODE">
        <value name="1_BIT" caption="One Stop Bit" value="0x0"/>
        <value name="2_BIT" caption="Two Stop Bits" value="0x1"/>
      </value-group>
    </module>
    <module name="SYSCTRL" id="U2100" version="2.0.1" caption="System Control">
      <register-group name="SYSCTRL" caption="System Control">
        <register name="INTENCLR" offset="0x0" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="XOSCRDY" caption="XOSC Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready Interrupt Enable" mask="0x2"/>
          <bitfield name="OSC32KRDY" caption="OSC32K Ready Interrupt Enable" mask="0x4"/>
          <bitfield name="OSC8MRDY" caption="OSC8M Ready Interrupt Enable" mask="0x8"/>
          <bitfield name="DFLLRDY" caption="DFLL Ready Interrupt Enable" mask="0x10"/>
          <bitfield name="DFLLOOB" caption="DFLL Out Of Bounds Interrupt Enable" mask="0x20"/>
          <bitfield name="DFLLLCKF" caption="DFLL Lock Fine Interrupt Enable" mask="0x40"/>
          <bitfield name="DFLLLCKC" caption="DFLL Lock Coarse Interrupt Enable" mask="0x80"/>
          <bitfield name="DFLLRCS" caption="DFLL Reference Clock Stopped Interrupt Enable" mask="0x100"/>
          <bitfield name="BOD33RDY" caption="BOD33 Ready Interrupt Enable" mask="0x200"/>
          <bitfield name="BOD33DET" caption="BOD33 Detection Interrupt Enable" mask="0x400"/>
          <bitfield name="B33SRDY" caption="BOD33 Synchronization Ready Interrupt Enable" mask="0x800"/>
          <bitfield name="DPLLLCKR" caption="DPLL Lock Rise Interrupt Enable" mask="0x8000"/>
          <bitfield name="DPLLLCKF" caption="DPLL Lock Fall Interrupt Enable" mask="0x10000"/>
          <bitfield name="DPLLLTO" caption="DPLL Lock Timeout Interrupt Enable" mask="0x20000"/>
        </register>
